2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
static void FallDetection_Invalidate(PosePipeline_t *pipeline);
static void Alarm_Update(void);


/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  Hardware_init();

  /*** App header *************************************************************/
  printf("========================================\n");
  printf("STM32N6-GettingStarted-PoseEstimation %s (%s)\n", APP_VERSION_STRING, APP_GIT_SHA1_STRING);
  printf("Build date & time: %s %s\n", __DATE__, __TIME__);
  #if defined(__GNUC__)
  printf("Compiler: GCC %d.%d.%d\n", __GNUC__, __GNUC_MINOR__, __GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
  printf("Compiler: IAR EWARM %d.%d.%d\n", __VER__ / 1000000, (__VER__ / 1000) % 1000 ,__VER__ % 1000);
#else
  printf("Compiler: Unknown\n");
#endif
  printf("HAL: %lu.%lu.%lu\n", __STM32N6xx_HAL_VERSION_MAIN, __STM32N6xx_HAL_VERSION_SUB1, __STM32N6xx_HAL_VERSION_SUB2);
  printf("STEdgeAI Tools: %d.%d.%d\n", STAI_TOOLS_VERSION_MAJOR, STAI_TOOLS_VERSION_MINOR, STAI_TOOLS_VERSION_MICRO);
  printf("NN model: %s\n", STAI_NETWORK_ORIGIN_MODEL_NAME);
#if FALL_DETECTION_MODEL == FALL_MODEL_GRU_STATEFUL
  printf("Fall model: %s (Stateful)\n", STAI_GRU_NETWORK_ORIGIN_MODEL_NAME);
#elif FALL_DETECTION_MODEL == FALL_MODEL_GRU_STATELESS
  printf("Fall model: %s (Stateless)\n", STAI_GRU_STATELESS_ORIGIN_MODEL_NAME);
#else
  printf("Fall model: %s\n", STAI_TCN_NETWORK_ORIGIN_MODEL_NAME);
#endif
  printf("========================================\n");

  /*** NN Init ****************************************************************/
  uint32_t pitch_nn = 0;
  uint32_t nn_in_len = 0;
  stai_size number_output = 0;
  stai_ptr nn_out[STAI_NETWORK_OUT_NUM] = {0};
  int32_t nn_out_len[STAI_NETWORK_OUT_NUM] = {0};

  NeuralNetwork_init(&nn_in_len, nn_out, &number_output, nn_out_len);
  FallModel_init();

  /*** Post Processing Init ***************************************************/
  stai_network_info info;
  int ret;

  ret = stai_network_get_info(network_context, &info);
  assert(ret == STAI_SUCCESS);
  app_postprocess_init(&pp_params, &info);

  /*** Pose pipeline Init *****************************************************/
  PosePipeline_Init(&pose_pipeline);
  pose_last_tick = HAL_GetTick();

  /*** Camera Init ************************************************************/
  CameraPipeline_Init(&lcd_bg_area.XSize, &lcd_bg_area.YSize, &pitch_nn);

  LCD_init();

  /* Start LCD Display camera pipe stream */
  CameraPipeline_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);

  /*** App Loop ***************************************************************/
  while (1)
  {
    CameraPipeline_IspUpdate();

    if (pitch_nn != (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL))
    {
      /* Start NN camera single capture Snapshot */
      CameraPipeline_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);
    }
    else
    {
      /* Start NN camera single capture Snapshot */
      SCB_InvalidateDCache_by_Addr(nn_in, nn_in_len);
      CameraPipeline_NNPipe_Start(nn_in, CMW_MODE_SNAPSHOT);
    }

    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;

    uint32_t ts[2] = { 0 };

    if (pitch_nn != (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL))
    {
      SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
    /*
     * Crop the image if the neural network (NN) input dimensions are not a multiple of 16.
     * The DCMIPP hardware requires the output image dimensions to be multiples of 16.
     * This ensures compatibility with the NN input dimensions.
     */
      img_crop(dcmipp_out_nn, nn_in, pitch_nn, STAI_NETWORK_IN_1_WIDTH, STAI_NETWORK_IN_1_HEIGHT, STAI_NETWORK_IN_1_CHANNEL);
      SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
    }
    else
    {
      SCB_InvalidateDCache_by_Addr(nn_in, nn_in_len);
    }

    ts[0] = HAL_GetTick();
    /* run ATON inference */
    Run_Inference(network_context);
    ts[1] = HAL_GetTick();

    for (int i = 0; i < number_output; i++)
    {
      SCB_InvalidateDCache_by_Addr(nn_out[i], nn_out_len[i]);
    }

    int32_t ret = app_postprocess_run((void **) nn_out, number_output, &pp_output, &pp_params);
    pose_debug_metrics.postprocess_status = ret;
    Update_PoseDebugMetrics(nn_out, nn_out_len, number_output, &pp_output);

    /* --- Pose pipeline (2 frames -> 15fps for model time-context) ------- */
    static uint32_t pipeline_frame_count = 0;
    pipeline_frame_count++;

    pose_debug_metrics.postprocess_valid = ((ret == AI_SPE_POSTPROCESS_ERROR_NO) &&
                                            (pp_output.pOutBuff != NULL)) ? 1u : 0u;

    /* --- Presence State Machine --- */
    if (pose_debug_metrics.postprocess_valid != 0u)
    {
      if (pose_debug_metrics.person_present != 0u)
      {
        /* Entry logic: Need consecutive frames to confirm */
        pose_debug_metrics.person_missing_count = 0u;
        if (pose_debug_metrics.person_present_confirmed == 0u)
        {
          pose_debug_metrics.person_entry_count++;
          if (pose_debug_metrics.person_entry_count >= FALL_PERSON_ENTRY_CONF_COUNT)
          {
            pose_debug_metrics.person_present_confirmed = 1u;
            pose_debug_metrics.person_missing_confirmed = 0u;
          }
        }
      }
      else
      {
        /* Exit logic: Need consecutive frames to confirm missing */
        pose_debug_metrics.person_entry_count = 0u;
        if (pose_debug_metrics.person_present_confirmed != 0u)
        {
          pose_debug_metrics.person_missing_count++;
          if (pose_debug_metrics.person_missing_count >= FALL_PERSON_MISSING_RESET_COUNT)
          {
            pose_debug_metrics.person_present_confirmed = 0u;
            pose_debug_metrics.person_missing_confirmed = 1u;
          }
        }
        else
        {
          pose_debug_metrics.person_missing_confirmed = 1u;
        }
      }
    }

    uint8_t pose_valid = ((pose_debug_metrics.postprocess_valid != 0u) &&
                          (pose_debug_metrics.person_present_confirmed != 0u)) ? 1u : 0u;
    
    /* Visualization depends on the confirmed presence state */
    pose_debug_metrics.draw_keypoints = ((pose_debug_metrics.postprocess_valid != 0u) &&
                                         (pose_debug_metrics.person_present_confirmed != 0u) &&
                                         (pose_debug_metrics.visible_keypoints > 0u)) ? 1u : 0u;

    if ((pose_valid != 0u) && (pipeline_frame_count % 2 == 0))
    {
      /* Use fixed dt to match the 15fps training context precisely, 
       * avoiding jitter from measured HAL_GetTick delta. */
      float32_t dt_s = 1.0f / 15.0f;
      pose_last_tick = HAL_GetTick();

      PoseFeatureVec_t feat_vec;
      PosePipeline_Process(&pose_pipeline, pp_output.pOutBuff, dt_s, &feat_vec);
      FallDetection_Update(&pose_pipeline);
    }
    else if (pose_valid == 0u)
    {
      FallDetection_Invalidate(&pose_pipeline);
    }

    Display_NetworkOutput(&pp_output, ts[1] - ts[0]);
    Alarm_Update();
  }
}


static void Hardware_init(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  CONSOLE_Config();

  NPURam_enable();

