2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
  Fuse_Programming();

  NPUCache_config();

  /*** External RAM and NOR Flash *********************************************/
  BSP_XSPI_RAM_Init(0);
  BSP_XSPI_RAM_EnableMemoryMappedMode(0);

  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);

  /* Set all required IPs as secure privileged */
  Security_Config();

  IAC_Config();
  set_clk_sleep_mode();

}

static void Run_Inference(stai_network *network_instance) {
  stai_return_code ret;

  do {
    ret = stai_network_run(network_instance, STAI_MODE_ASYNC);
    if (ret == STAI_RUNNING_WFE)
      LL_ATON_OSAL_WFE();
  } while (ret == STAI_RUNNING_WFE || ret == STAI_RUNNING_NO_WFE);

  ret = stai_ext_network_new_inference(network_instance);
  assert(ret == STAI_SUCCESS);
}

static void Run_FallInference(void) {
  stai_return_code ret;

#if FALL_DETECTION_IS_GRU
  #if FALL_DETECTION_MODEL == FALL_MODEL_GRU_STATEFUL
    ret = stai_gru_network_run(gru_network_context, STAI_MODE_SYNC);
  #else
    ret = stai_gru_stateless_run(gru_network_context, STAI_MODE_SYNC);
  #endif
#else
  do {
    ret = stai_tcn_network_run(tcn_network_context, STAI_MODE_ASYNC);
    if (ret == STAI_RUNNING_WFE)
      LL_ATON_OSAL_WFE();
  } while (ret == STAI_RUNNING_WFE || ret == STAI_RUNNING_NO_WFE);
  ret = stai_ext_tcn_network_new_inference(tcn_network_context);
#endif
  assert(ret == STAI_SUCCESS);
}

static void NeuralNetwork_init(uint32_t *nn_in_length, stai_ptr *nn_out, stai_size *number_output, int32_t nn_out_len[])
{
  stai_network_info info;
  int ret;

  /* initialize runtime */
  ret = stai_runtime_init();
  assert(ret == STAI_SUCCESS);
  /* init model instance */
  ret = stai_network_init(network_context);
  assert(ret == STAI_SUCCESS);

  ret = stai_network_get_info(network_context, &info);
  assert(ret == STAI_SUCCESS);
  assert(info.n_inputs == 1);
  *number_output = STAI_NETWORK_OUT_NUM;

  /* Get the input buffer size & address */
  *nn_in_length = info.inputs[0].size_bytes;
  ret = stai_network_get_inputs(network_context, &nn_in, (stai_size *)&info.n_inputs);
  assert(ret == STAI_SUCCESS);

  /* Get the output buffers size & address */
  ret = stai_network_get_outputs(network_context, nn_out, number_output);
  assert(ret == STAI_SUCCESS);
  for (int i = 0; i < *number_output; i++)
  {
    nn_out_len[i] = info.outputs[i].size_bytes;
  }
}

static void FallModel_init(void)
{
  int ret;

#if FALL_DETECTION_IS_GRU
  #if FALL_DETECTION_MODEL == FALL_MODEL_GRU_STATEFUL
    stai_size number_input  = STAI_GRU_NETWORK_IN_NUM;
    stai_size number_output = STAI_GRU_NETWORK_OUT_NUM;
    ret = stai_gru_network_init(gru_network_context);
    assert(ret == STAI_SUCCESS);
    stai_ptr act_bufs[STAI_GRU_NETWORK_ACTIVATIONS_NUM] = { (stai_ptr)gru_activation_buf };
    ret = stai_gru_network_set_activations(gru_network_context, act_bufs, STAI_GRU_NETWORK_ACTIVATIONS_NUM);
    assert(ret == STAI_SUCCESS);
    ret = stai_gru_network_get_inputs(gru_network_context, gru_in, &number_input);
    assert(ret == STAI_SUCCESS);
    ret = stai_gru_network_get_outputs(gru_network_context, gru_out, &number_output);
    assert(ret == STAI_SUCCESS);
    gru_in_len[0]  = STAI_GRU_NETWORK_IN_1_SIZE_BYTES;   /* c1_window f32(1,5,27) */
    gru_in_len[1]  = STAI_GRU_NETWORK_IN_2_SIZE_BYTES;   /* c2_in    int8(1,2,64) */
    gru_in_len[2]  = STAI_GRU_NETWORK_IN_3_SIZE_BYTES;   /* h1       int8(1,128)  */
    gru_in_len[3]  = STAI_GRU_NETWORK_IN_4_SIZE_BYTES;   /* h2       int8(1,64)   */
    gru_out_len[0] = STAI_GRU_NETWORK_OUT_1_SIZE_BYTES;  /* h2_new   int8(1,64)   */
    gru_out_len[1] = STAI_GRU_NETWORK_OUT_2_SIZE_BYTES;  /* softmax  int8(1,2)    */
    gru_out_len[2] = STAI_GRU_NETWORK_OUT_3_SIZE_BYTES;  /* h1_new   int8(1,128)  */
    gru_out_len[3] = STAI_GRU_NETWORK_OUT_4_SIZE_BYTES;  /* c1_last  int8(1,64,1) */
    /* Initialize states to their INT8 zero-points (= float 0.0):
     *   h1 zp=-1, h2 zp=0, c2 zp=-128 */
    memset(gru_h1, (int8_t)STAI_GRU_NETWORK_IN_3_ZERO_POINT, sizeof(gru_h1));
    memset(gru_h2, (int8_t)STAI_GRU_NETWORK_IN_4_ZERO_POINT, sizeof(gru_h2));
    memset(gru_c1, 0, sizeof(gru_c1));
    memset(gru_c2, (int8_t)STAI_GRU_NETWORK_IN_2_ZERO_POINT, sizeof(gru_c2));
    memset(gru_c1_window, 0, sizeof(gru_c1_window));
  #else /* STATELESS */
    stai_size number_input  = STAI_GRU_STATELESS_IN_NUM;
    stai_size number_output = STAI_GRU_STATELESS_OUT_NUM;
    ret = stai_gru_stateless_init(gru_network_context);
    assert(ret == STAI_SUCCESS);
    stai_ptr act_bufs[STAI_GRU_STATELESS_ACTIVATIONS_NUM] = { (stai_ptr)gru_activation_buf };
    ret = stai_gru_stateless_set_activations(gru_network_context, act_bufs, STAI_GRU_STATELESS_ACTIVATIONS_NUM);
    assert(ret == STAI_SUCCESS);
    ret = stai_gru_stateless_get_inputs(gru_network_context, gru_in, &number_input);
    assert(ret == STAI_SUCCESS);
    ret = stai_gru_stateless_get_outputs(gru_network_context, gru_out, &number_output);
    assert(ret == STAI_SUCCESS);
    gru_in_len[0]  = STAI_GRU_STATELESS_IN_1_SIZE_BYTES;
    gru_out_len[0] = STAI_GRU_STATELESS_OUT_1_SIZE_BYTES;
  #endif
#else /* TCN */
  stai_network_info info;
  stai_size number_input  = STAI_TCN_NETWORK_IN_NUM;
  stai_size number_output = STAI_TCN_NETWORK_OUT_NUM;

  ret = stai_tcn_network_init(tcn_network_context);
  assert(ret == STAI_SUCCESS);

  ret = stai_tcn_network_get_info(tcn_network_context, &info);
  assert(ret == STAI_SUCCESS);
  assert(info.n_inputs  == STAI_TCN_NETWORK_IN_NUM);
  assert(info.n_outputs == STAI_TCN_NETWORK_OUT_NUM);
  assert(info.inputs[0].size_bytes  == STAI_TCN_NETWORK_IN_1_SIZE_BYTES);
  assert(info.outputs[0].size_bytes == STAI_TCN_NETWORK_OUT_1_SIZE_BYTES);

  ret = stai_tcn_network_get_inputs(tcn_network_context, &tcn_in, &number_input);
  assert(ret == STAI_SUCCESS);

  ret = stai_tcn_network_get_outputs(tcn_network_context, tcn_out, &number_output);
  assert(ret == STAI_SUCCESS);

  for (int i = 0; i < STAI_TCN_NETWORK_OUT_NUM; i++)
    tcn_out_len[i] = info.outputs[i].size_bytes;
#endif

  memset(&fall_state, 0, sizeof(fall_state));
  /* Show "no person" on startup until presence is confirmed. */
  pose_debug_metrics.person_missing_confirmed = 1u;

