2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
  BSP_LED_Init(LED_RED);
  BSP_LED_Off(LED_RED);
}

static void FallDetection_Update(PosePipeline_t *pipeline)
{
  fall_state.frame_count = pipeline->win_count;

#if FALL_DETECTION_IS_GRU
  #if FALL_DETECTION_MODEL == FALL_MODEL_GRU_STATEFUL
    /* GRU stateful: run every frame, show result after warmup */
    fall_state.window_ready = (pipeline->win_count >= GRU_WARMUP_FRAMES) ? 1u : 0u;

    if (pipeline->win_count == 0)
    {
      fall_state.fall_detected = 0;
      fall_state.fall_score    = 0.0f;
      fall_state.normal_score  = 0.0f;
      fall_state.inference_ms  = 0;
      return;
    }

    /* Pure data warmup: Let the pose pipeline filters stabilize for the first 5 frames 
     * before starting GRU inference. This prevents filter initialization spikes 
     * from corrupting the GRU hidden state. */
    if (pipeline->win_count < 5)
    {
      return;
    }

    /* INT8 Stateful Flow (4-input):
       IN: [0]c1_window f32(1,5,27), [1]c2_in int8(1,2,64), [2]h1 int8(1,128), [3]h2 int8(1,64)
       OUT:[0]h2_new int8(1,64), [1]softmax int8(1,2), [2]h1_new int8(1,128), [3]c1_last int8(1,64) */
    /* Build c1_window: rows [0..3] = c1_state history, row [4] = current pose */
    memcpy(gru_c1_window, gru_c1, 4u * sizeof(gru_c1[0]));
    PosePipeline_GetLatestFeature(pipeline, gru_c1_window[4]);
    memcpy(gru_in[0], gru_c1_window, STAI_GRU_NETWORK_IN_1_SIZE_BYTES);
    memcpy(gru_in[1], gru_c2, STAI_GRU_NETWORK_IN_2_SIZE_BYTES);
    memcpy(gru_in[2], gru_h1, STAI_GRU_NETWORK_IN_3_SIZE_BYTES);
    memcpy(gru_in[3], gru_h2, STAI_GRU_NETWORK_IN_4_SIZE_BYTES);

    for (int i = 0; i < STAI_GRU_NETWORK_IN_NUM; i++)
      SCB_CleanDCache_by_Addr(gru_in[i], gru_in_len[i]);

    uint32_t t0 = HAL_GetTick();
    Run_FallInference();
    uint32_t t1 = HAL_GetTick();
    fall_state.inference_ms = t1 - t0;

    for (int i = 0; i < STAI_GRU_NETWORK_OUT_NUM; i++)
      SCB_InvalidateDCache_by_Addr(gru_out[i], gru_out_len[i]);

    /* Update persistent states from INT8 model outputs */
    memcpy(gru_h2, gru_out[0], STAI_GRU_NETWORK_OUT_1_SIZE_BYTES);   /* h2_new  int8(1,64) */
    memcpy(gru_h1, gru_out[2], STAI_GRU_NETWORK_OUT_3_SIZE_BYTES);   /* h1_new  int8(1,128) */
    
    /* c1_state: shift window by 1 and append the latest pose */
    memmove(gru_c1[0], gru_c1[1], 3u * sizeof(gru_c1[0]));
    memcpy(gru_c1[3], gru_c1_window[4], sizeof(gru_c1[0]));

    /* c2_state: shift window by 1 and append c1_last int8(1,64) 
     * CRITICAL: Must re-quantize because OUT_4 scale (0.016) != IN_2 scale (0.013) */
    memcpy(gru_c2[0], gru_c2[1], 64u * sizeof(int8_t));
    const int8_t *c1_last_raw = (const int8_t *)gru_out[3];
    const float32_t scale_ratio = STAI_GRU_NETWORK_OUT_4_SCALE / STAI_GRU_NETWORK_IN_2_SCALE;
    
    for (int i = 0; i < 64; i++) {
        /* val_f = (raw - old_ZP) * old_scale
         * new_q = (val_f / new_scale) + new_ZP
         * new_q = (raw - old_ZP) * (old_scale / new_scale) + new_ZP */
        float32_t val = (float32_t)(c1_last_raw[i] - STAI_GRU_NETWORK_OUT_4_ZERO_POINT) * scale_ratio;
        int32_t q = (int32_t)roundf(val) + STAI_GRU_NETWORK_IN_2_ZERO_POINT;
        if (q < -128) q = -128;
        if (q > 127)  q = 127;
        gru_c2[1][i] = (int8_t)q;
    }

    /* Dequantize int8 softmax output → float probabilities */
    const int8_t *probs_int8 = (const int8_t *)gru_out[1];
    float32_t f_norm = (float32_t)((int32_t)probs_int8[0] - STAI_GRU_NETWORK_OUT_2_ZERO_POINT) * STAI_GRU_NETWORK_OUT_2_SCALE;
    float32_t f_fall = (float32_t)((int32_t)probs_int8[1] - STAI_GRU_NETWORK_OUT_2_ZERO_POINT) * STAI_GRU_NETWORK_OUT_2_SCALE;
    
    /* Re-normalize current inference results */
    float32_t sum = f_norm + f_fall;
    if (sum > 1e-6f)
    {
      float32_t raw_n = f_norm / sum;
      float32_t raw_f = f_fall / sum;
      
      /* Apply strong EMA (alpha=0.15) to accumulate evidence over ~0.5s.
       * This eliminates jumping values during standing still. */
      const float32_t alpha = 0.15f;
      fall_state.normal_score = (alpha * raw_n) + (1.0f - alpha) * fall_state.normal_score;
      fall_state.fall_score   = (alpha * raw_f) + (1.0f - alpha) * fall_state.fall_score;
      
      /* Force sum=1.0 for logical consistency */
      float32_t final_sum = fall_state.normal_score + fall_state.fall_score;
      fall_state.normal_score /= final_sum;
      fall_state.fall_score /= final_sum;
    }
    else
    {
      /* Keep previous smoothed scores if inference is invalid */
    }

    fall_state.normal_logit = fall_state.normal_score; 
    fall_state.fall_logit   = fall_state.fall_score;
    
    /* Skip common softmax step as we already have probabilities */
    goto skip_softmax;
  #else /* STATELESS */
    fall_state.window_ready = PosePipeline_WindowFull(pipeline);

    if (!fall_state.window_ready)
    {
      fall_state.fall_detected = 0;
      fall_state.fall_score    = 0.0f;
      fall_state.normal_score  = 0.0f;
      fall_state.inference_ms  = 0;
      return;
    }

    PosePipeline_GetWindowTimeFirst(pipeline, (float32_t (*)[POSE_FEATURE_COUNT])gru_in[0]);
    SCB_CleanDCache_by_Addr(gru_in[0], gru_in_len[0]);

    uint32_t t0 = HAL_GetTick();
    Run_FallInference();
    uint32_t t1 = HAL_GetTick();
    fall_state.inference_ms = t1 - t0;

    SCB_InvalidateDCache_by_Addr(gru_out[0], gru_out_len[0]);
    float32_t *logits = (float32_t *)gru_out[0];
  #endif
#else /* TCN */
  fall_state.window_ready = PosePipeline_WindowFull(pipeline);

  if (!fall_state.window_ready)
  {
    fall_state.fall_detected = 0;
    fall_state.fall_score    = 0.0f;
    fall_state.normal_score  = 0.0f;
    fall_state.inference_ms  = 0;
    return;
  }

  PosePipeline_GetWindowFeaturesFirst(pipeline, (float32_t (*)[POSE_WINDOW_SIZE])tcn_in);
  SCB_CleanDCache_by_Addr(tcn_in, STAI_TCN_NETWORK_IN_1_SIZE_BYTES);

  uint32_t t0 = HAL_GetTick();
  Run_FallInference();
  uint32_t t1 = HAL_GetTick();
  fall_state.inference_ms = t1 - t0;

  SCB_InvalidateDCache_by_Addr(tcn_out[0], tcn_out_len[0]);
  float32_t *logits = (float32_t *)tcn_out[0];
#endif

skip_softmax:
#if FALL_DETECTION_MODEL != FALL_MODEL_GRU_STATEFUL
  fall_state.normal_logit = logits[0];
  fall_state.fall_logit   = logits[1];

  /* Perform manual softmax for numerical stability across all models (Stateless, Stateless, TCN). */
  float32_t max_logit  = (logits[0] > logits[1]) ? logits[0] : logits[1];
  float32_t normal_exp = expf(logits[0] - max_logit);
  float32_t fall_exp   = expf(logits[1] - max_logit);
  float32_t denom      = normal_exp + fall_exp;

