2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
  if (denom > 0.0f)
  {
    fall_state.normal_score = normal_exp / denom;
    fall_state.fall_score   = fall_exp   / denom;
  }
  else
  {
    fall_state.normal_score = 0.5f;
    fall_state.fall_score   = 0.5f;
  }
#endif

  if (fall_state.window_ready) {
    /* Compare probability scores (ratios), not raw logits */
    fall_state.fall_detected = (fall_state.fall_score >= GRU_FALL_SCORE_THRESHOLD) ? 1u : 0u;
  } else {
    fall_state.fall_detected = 0u;
}
  if (fall_state.fall_detected)
    fall_state.fall_latch_tick = HAL_GetTick();

  if (fall_state.window_ready)
  {
    static uint32_t last_fall_log_tick = 0;
    uint32_t now_tick = HAL_GetTick();
    if ((last_fall_log_tick == 0u) || ((now_tick - last_fall_log_tick) >= 1000u))
    {
      printf("[%s] %lums %s Fall %.2f Normal %.2f KP %lu/%lu P%lu\r\n",
             (FALL_DETECTION_MODEL == FALL_DETECTION_IS_GRU) ? "GRU" : "TCN",
             fall_state.inference_ms,
             fall_state.fall_detected ? "FALL" : "NORMAL",
             (double)fall_state.fall_score,
             (double)fall_state.normal_score,
             pose_debug_metrics.visible_keypoints,
             (uint32_t)AI_POSE_PP_POSE_KEYPOINTS_NB,
             pose_debug_metrics.person_keypoints);
      last_fall_log_tick = now_tick;
    }
  }

#if FALL_DETECTION_MODEL == FALL_DETECTION_IS_GRU
  if (fall_state.fall_detected)
  {
    fall_state.fall_consec_count++;
    if (fall_state.fall_consec_count >= GRU_FALL_RESET_COUNT)
    {
      printf("[GRU] Fall confirmed (%lu frames) - resetting state\r\n",
             fall_state.fall_consec_count);
#if FALL_DETECTION_MODEL == FALL_MODEL_GRU_STATEFUL
      memset(gru_h1, (int8_t)STAI_GRU_NETWORK_IN_3_ZERO_POINT, sizeof(gru_h1));
      memset(gru_h2, (int8_t)STAI_GRU_NETWORK_IN_4_ZERO_POINT, sizeof(gru_h2));
      memset(gru_c1, 0, sizeof(gru_c1));
      memset(gru_c2, (int8_t)STAI_GRU_NETWORK_IN_2_ZERO_POINT, sizeof(gru_c2));
      memset(gru_c1_window, 0, sizeof(gru_c1_window));
#elif FALL_DETECTION_MODEL == FALL_MODEL_GRU_STATELESS
      memset(gru_h1, 0, sizeof(gru_h1));
      memset(gru_h2, 0, sizeof(gru_h2));
#endif
      PosePipeline_Init(pipeline);
      fall_state.fall_consec_count = 0;
      fall_state.frame_count       = 0;
      fall_state.window_ready      = 0;
      /* fall_detected stays 1 so the display keeps showing FALL this frame */
    }
  }
  else
  {
    fall_state.fall_consec_count = 0;
  }
#endif
}


static void FallDetection_Invalidate(PosePipeline_t *pipeline)
{
  if (pipeline != NULL)
  {
    /* Always clear filters on invalidate.
     * Prevents massive acceleration spikes when a person reappears. */
    PosePipeline_Init(pipeline);
  }

#if FALL_DETECTION_MODEL == FALL_MODEL_GRU_STATEFUL
  memset(gru_h1, (int8_t)STAI_GRU_NETWORK_IN_3_ZERO_POINT, sizeof(gru_h1));
  memset(gru_h2, (int8_t)STAI_GRU_NETWORK_IN_4_ZERO_POINT, sizeof(gru_h2));
  memset(gru_c1, 0, sizeof(gru_c1));
  memset(gru_c2, (int8_t)STAI_GRU_NETWORK_IN_2_ZERO_POINT, sizeof(gru_c2));
  memset(gru_c1_window, 0, sizeof(gru_c1_window));
#elif FALL_DETECTION_MODEL == FALL_MODEL_GRU_STATELESS
  memset(gru_h1, 0, sizeof(gru_h1));
  memset(gru_h2, 0, sizeof(gru_h2));
#endif

  fall_state.window_ready = 0u;
  fall_state.fall_detected = 0u;
  fall_state.frame_count = 0u;
  fall_state.inference_ms = 0u;
  fall_state.normal_logit = 1.0f;
  fall_state.fall_logit = 0.0f;
  fall_state.normal_score = 1.0f;
  fall_state.fall_score = 0.0f;
  fall_state.fall_consec_count = 0u;
}

static void Alarm_Update(void)
{
  uint8_t latch_active = (fall_state.fall_latch_tick != 0u) &&
                         ((HAL_GetTick() - fall_state.fall_latch_tick) < GRU_FALL_LATCH_MS);

  if (latch_active)
  {
    /* Blink LED_RED at ~2Hz while alarm is active */
    if ((HAL_GetTick() % (2u * GRU_ALARM_BLINK_PERIOD_MS)) < GRU_ALARM_BLINK_PERIOD_MS)
      BSP_LED_On(LED_RED);
    else
      BSP_LED_Off(LED_RED);
  }
  else
  {
    BSP_LED_Off(LED_RED);
  }
}

static void NPURam_enable(void)
{
  __HAL_RCC_NPU_CLK_ENABLE();
  __HAL_RCC_NPU_FORCE_RESET();
  __HAL_RCC_NPU_RELEASE_RESET();

  /* Enable NPU RAMs (4x448KB) */
  __HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();
  __HAL_RCC_RAMCFG_CLK_ENABLE();
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM3_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM4_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM5_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
}

static void set_clk_sleep_mode(void)
{
  /*** Enable sleep mode support during NPU inference *************************/
  /* Configure peripheral clocks to remain active during sleep mode */
  /* Keep all IP's enabled during WFE so they can wake up CPU. Fine tune
   * this if you want to save maximum power
   */
  __HAL_RCC_XSPI1_CLK_SLEEP_ENABLE();    /* For display frame buffer */
  __HAL_RCC_XSPI2_CLK_SLEEP_ENABLE();    /* For NN weights */
  __HAL_RCC_NPU_CLK_SLEEP_ENABLE();      /* For NN inference */
  __HAL_RCC_CACHEAXI_CLK_SLEEP_ENABLE(); /* For NN inference */
  __HAL_RCC_LTDC_CLK_SLEEP_ENABLE();     /* For display */
  __HAL_RCC_DMA2D_CLK_SLEEP_ENABLE();    /* For display */
  __HAL_RCC_DCMIPP_CLK_SLEEP_ENABLE();   /* For camera configuration retention */
  __HAL_RCC_CSI_CLK_SLEEP_ENABLE();      /* For camera configuration retention */

  __HAL_RCC_FLEXRAM_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM1_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM2_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM3_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_SLEEP_ENABLE(); 

}

static void NPUCache_config(void)
{
  npu_cache_enable();
}

static void Security_Config(void)
{
  __HAL_RCC_RIFSC_CLK_ENABLE();
  RIMC_MasterConfig_t RIMC_master = {0};
  RIMC_master.MasterCID = RIF_CID_1;
  RIMC_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_NPU, &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DMA2D, &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DCMIPP, &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC1 , &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC2 , &RIMC_master);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_NPU , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DMA2D , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_CSI    , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DCMIPP , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDC   , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL1 , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL2 , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
}

