2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
static void IAC_Config(void)
{
/* Configure IAC to trap illegal access events */
  __HAL_RCC_IAC_CLK_ENABLE();
  __HAL_RCC_IAC_FORCE_RESET();
  __HAL_RCC_IAC_RELEASE_RESET();
}

void IAC_IRQHandler(void)
{
  printf("[FAULT] IAC IllegalAccess!\r\n");
  while (1) {}
}

/* Display functions */
static int clamp_point(int *x, int *y)
{
  int xi = *x;
  int yi = *y;

  if (*x < (int)lcd_bg_area.X0)
    *x = lcd_bg_area.X0;
  if (*y < (int)lcd_bg_area.Y0)
    *y = lcd_bg_area.Y0;
  if (*x >= lcd_bg_area.X0 + lcd_bg_area.XSize)
    *x = lcd_bg_area.X0 + lcd_bg_area.XSize - 1;
  if (*y >= lcd_bg_area.Y0 + lcd_bg_area.YSize)
    *y = lcd_bg_area.Y0 + lcd_bg_area.YSize - 1;

  return (xi != *x) || (yi != *y);
}

static void convert_length(float32_t wi, float32_t hi, int *wo, int *ho)
{
  *wo = lcd_bg_area.XSize * wi;
  *ho = lcd_bg_area.YSize * hi;
}

static void convert_point(float32_t xi, float32_t yi, int *xo, int *yo)
{
  *xo = lcd_bg_area.XSize * xi + lcd_bg_area.X0;
  *yo = lcd_bg_area.YSize * yi + lcd_bg_area.Y0;
}

static void Display_binding_line(int x0, int y0, int x1, int y1, uint32_t color)
{
  clamp_point(&x0, &y0);
  clamp_point(&x1, &y1);

  UTIL_LCD_DrawLine(x0, y0, x1, y1, color);
}

/**
* @brief Display Neural Network output classification results as well as other performances informations
*
* @param p_postprocess pointer to postprocessing output
* @param inference_ms inference time in ms
*/
static void Display_NetworkOutput(void *p_postprocess, uint32_t inference_ms)
{
#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UI
  mpe_pp_outBuffer_t *rois = ((mpe_pp_out_t *) p_postprocess)->pOutBuff;
  uint32_t nb_rois = ((mpe_pp_out_t *) p_postprocess)->nb_detect;
#elif POSTPROCESS_TYPE == POSTPROCESS_SPE_MOVENET_UI
  spe_pp_outBuffer_t *roi = (p_postprocess != NULL) ? ((spe_pp_out_t *) p_postprocess)->pOutBuff : NULL;
#endif
  int ret;

  ret = HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc, (uint32_t) lcd_fg_buffer[lcd_fg_buffer_rd_idx], LTDC_LAYER_2);
  assert(ret == HAL_OK);

  /* Draw bounding boxes */
  UTIL_LCD_FillRect(lcd_fg_area.X0, lcd_fg_area.Y0, lcd_fg_area.XSize, lcd_fg_area.YSize, 0x00000000); /* Clear previous boxes */
#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UI
  for (int i = 0; i < nb_rois; i++)
    Display_mpe_Detection(&rois[i]);
  UTIL_LCDEx_PrintfAt(0, LINE(2), CENTER_MODE, "Objects %u", nb_rois);
#elif POSTPROCESS_TYPE == POSTPROCESS_SPE_MOVENET_UI
    if (roi != NULL)
    {
      /* --- RAW MODE: Bypassing filters for visualization --- */
      Display_spe_Detection(roi);
    }
#endif
  UTIL_LCD_SetBackColor(0x40000000);
  if (pose_debug_metrics.postprocess_valid == 0u)
  {
    UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_GRAY);
    UTIL_LCDEx_PrintfAt(0, LINE(1), CENTER_MODE, "postprocess error PP %ld",
                        (long)pose_debug_metrics.postprocess_status);
  }
  else if (pose_debug_metrics.person_missing_confirmed != 0u)
  {
    UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_GRAY);
    UTIL_LCDEx_PrintfAt(0, LINE(1), CENTER_MODE, "no person");
  }
  else
  {
    uint8_t latch_active = (fall_state.fall_latch_tick != 0u) &&
                           ((HAL_GetTick() - fall_state.fall_latch_tick) < GRU_FALL_LATCH_MS);

    if (fall_state.window_ready || latch_active)
    {
      uint8_t is_fall_now = fall_state.fall_detected;
      
      /* Clear status lines by filling with background */
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_BLACK);
      UTIL_LCD_FillRect(0, LINE(1), LCD_FG_WIDTH, 24, 0); 
      
      if (is_fall_now) {
        UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_RED);
        UTIL_LCDEx_PrintfAt(0, LINE(1), CENTER_MODE, "!! FALL !! F:%.2f N:%.2f %lums",
                            (double)fall_state.fall_score, (double)fall_state.normal_score, fall_state.inference_ms);
      } else if (latch_active) {
        UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_ORANGE);
        UTIL_LCDEx_PrintfAt(0, LINE(1), CENTER_MODE, "LATCHED F:%.2f N:%.2f %lums",
                            (double)fall_state.fall_score, (double)fall_state.normal_score, fall_state.inference_ms);
      } else {
        UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_GREEN);
        UTIL_LCDEx_PrintfAt(0, LINE(1), CENTER_MODE, "NORMAL F:%.2f N:%.2f %lums",
                            (double)fall_state.fall_score, (double)fall_state.normal_score, fall_state.inference_ms);
      }

      if (latch_active)
      {
        /* Large warning text without the screen-blocking banner */
        UTIL_LCD_SetFont(&Font24);
        UTIL_LCD_SetBackColor(0x00000000);
        UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
        UTIL_LCDEx_PrintfAt(0, 228, CENTER_MODE, "!! FALL DETECTED !!");
        UTIL_LCD_SetFont(&Font20);
        UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_YELLOW);
        /* Show smoothed real-time confidence */
        UTIL_LCDEx_PrintfAt(0, 258, CENTER_MODE, "Confidence: %.0f%%",
                            (double)(fall_state.fall_score * 100.0f));
      }
    }
    else
    {
      uint32_t warmup_target = (FALL_DETECTION_MODEL == FALL_DETECTION_IS_GRU) ? GRU_WARMUP_FRAMES : POSE_WINDOW_SIZE;
      UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_YELLOW);
      UTIL_LCDEx_PrintfAt(0, LINE(1), CENTER_MODE, "Fall detector warming %lu/%u",
                          fall_state.frame_count,
                          warmup_target);
    }
  }
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCDEx_PrintfAt(0, LINE(2), CENTER_MODE, "KP %lu/%u P%lu M%lu Max %.2f",
                      pose_debug_metrics.visible_keypoints,
                      (uint32_t)AI_POSE_PP_POSE_KEYPOINTS_NB,
                      pose_debug_metrics.person_keypoints,
                      pose_debug_metrics.person_missing_count,
                      (double)pose_debug_metrics.max_keypoint_proba);
  UTIL_LCDEx_PrintfAt(0, LINE(3), CENTER_MODE, "Raw[%d,%d] Deq[%.2f,%.2f]",
                      pose_debug_metrics.raw_min,
                      pose_debug_metrics.raw_max,
                      (double)pose_debug_metrics.raw_min_dequant,
                      (double)pose_debug_metrics.raw_max_dequant);
  UTIL_LCDEx_PrintfAt(0, LINE(4), CENTER_MODE, "Out %lux%lux%lu PP %ld",
                      pose_debug_metrics.output_width,
                      pose_debug_metrics.output_height,
                      pose_debug_metrics.output_channels,
                      (long)pose_debug_metrics.postprocess_status);
  UTIL_LCDEx_PrintfAt(0, LINE(20), CENTER_MODE, "Inference: %ums", inference_ms);

  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCD_SetFont(&Font20);
  UTIL_LCD_SetBackColor(0);

  Display_WelcomeScreen();

  SCB_CleanDCache_by_Addr(lcd_fg_buffer[lcd_fg_buffer_rd_idx], LCD_FG_FRAMEBUFFER_SIZE);
  ret = HAL_LTDC_ReloadLayer(&hlcd_ltdc, LTDC_RELOAD_VERTICAL_BLANKING, LTDC_LAYER_2);
  assert(ret == HAL_OK);
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}

static void Update_PoseDebugMetrics(stai_ptr *nn_out, int32_t nn_out_len[], stai_size number_output, spe_pp_out_t *p_postprocess)
{
  pose_debug_metrics.raw_min = 0;
  pose_debug_metrics.raw_max = 0;
  pose_debug_metrics.raw_min_dequant = 0.0f;
  pose_debug_metrics.raw_max_dequant = 0.0f;
  pose_debug_metrics.max_keypoint_proba = 0.0f;
  pose_debug_metrics.visible_keypoints = 0;
  pose_debug_metrics.person_keypoints = 0;
  pose_debug_metrics.person_present = 0u;
  pose_debug_metrics.postprocess_valid = 0u;
  pose_debug_metrics.draw_keypoints = 0u;
  pose_debug_metrics.output_width = STAI_NETWORK_OUT_1_WIDTH;
  pose_debug_metrics.output_height = STAI_NETWORK_OUT_1_HEIGHT;
  pose_debug_metrics.output_channels = STAI_NETWORK_OUT_1_CHANNEL;

